Aricg/esp32/esp32/ESP8266_SGP30_gas_sensor/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_SGP30.h>
#include <Adafruit_SGP40.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

// Define pins for I2C
#define SDA_PIN 4
#define SCL_PIN 5

// WiFi credentials from environment variables
const char* ssid = WIFI_SSID;
const char* password = WIFI_PASSWORD;

// Metrics server configuration
const char* serverUrl = "http://192.168.88.126:5000/data";
const unsigned long postInterval = 10000; // Post data every 10 seconds
unsigned long lastPostTime = 0;

// Create sensor objects
Adafruit_SGP30 sgp30;
Adafruit_SGP40 sgp40;

// Function prototypes
void scanI2CBus();
String detectSensorType(uint8_t address);
void sendSensorData(const char* sensorName, int sensorValue);
uint32_t getAbsoluteHumidity(float temperature, float humidity);

// Global variables for sensor control
bool useManualReading = false;
bool useSGP40 = false;
uint8_t sensorAddress = 0x58; // Default address
String sensorType = "Unknown"; // Will store detected sensor type: SGP30, SGP40, SGP41, or Unknown

// Variables to store sensor readings
uint16_t TVOC = 0;
uint16_t eCO2 = 0;
uint32_t lastMeasurement = 0;
uint32_t lastBaseline = 0;
uint16_t TVOC_base, eCO2_base;
bool baselineValid = false;

void setup() {
  // Initialize serial communication
  Serial.begin(9600);
  delay(1000); // Give serial port time to initialize
  Serial.println("\n\n--- SGP30 Gas Sensor Test ---");

  // Wait for sensor to power up fully
  delay(2000);
  Serial.println("Initializing I2C...");
  
  // Initialize I2C with custom pins
  Wire.begin(SDA_PIN, SCL_PIN);
  delay(500); // Give I2C time to initialize
  
  // Scan I2C bus to see what devices are connected
  scanI2CBus();
  
  // Connect to WiFi
  WiFi.begin(ssid, password);
  Serial.print("Connecting to WiFi");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }
  Serial.println();
  Serial.print("Connected to WiFi, IP address: ");
  Serial.println(WiFi.localIP());

  // Try to initialize SGP30 sensor
  Serial.println("Initializing SGP30 sensor...");
  delay(50);
  
  // Set I2C to a slower speed for better reliability
  Wire.setClock(10000); // 10 kHz
  Serial.println("I2C clock set to 10 kHz for stability");
  delay(50);
  
  Serial.print("Using I2C pins - SDA: ");
  Serial.print(SDA_PIN);
  Serial.print(", SCL: ");
  Serial.println(SCL_PIN);
  delay(50);
  
  // Try a gentler I2C reset approach
  Serial.println("Performing gentle I2C reset...");
  
  // End any pending transmission
  Wire.endTransmission(true);
  delay(100);
  
  // Re-initialize I2C with pullups enabled
  Wire.begin(SDA_PIN, SCL_PIN);
  delay(200);
  
  // Try direct I2C communication first with both addresses
  Wire.beginTransmission(0x58); // Standard SGP address
  byte error = Wire.endTransmission();
  bool foundAt0x58 = (error == 0);
  
  if (foundAt0x58) {
    Serial.println("Direct I2C communication with sensor at 0x58 successful");
    delay(50);
    
    // Try to identify which sensor we have
    sensorType = detectSensorType(0x58);
    Serial.print("Detected sensor type at 0x58: ");
    Serial.println(sensorType);
  } else {
    Serial.print("Communication with 0x58 failed with error: ");
    Serial.println(error);
    delay(50);
  }
  
  // Try alternate address
  Wire.beginTransmission(0x59);
  error = Wire.endTransmission();
  bool foundAt0x59 = (error == 0);
  
  if (foundAt0x59) {
    Serial.println("Found device at alternate address 0x59");
    Serial.println("Will attempt to use this device instead");
    delay(50);
    
    // Try to identify which sensor we have at 0x59
    sensorType = detectSensorType(0x59);
    Serial.print("Detected sensor type at 0x59: ");
    Serial.println(sensorType);
  } else {
    Serial.print("Communication with 0x59 failed with error: ");
    Serial.println(error);
    delay(50);
  }
  
  // Try to read some data from the device at 0x59
  if (foundAt0x59) {
    Wire.beginTransmission(0x59);
    Wire.write(0x20); // Command to read serial ID
    Wire.write(0x03);
    error = Wire.endTransmission();
    
    if (error == 0) {
      delay(10);
      Wire.requestFrom((uint8_t)0x59, (uint8_t)6);
      if (Wire.available() >= 6) {
        Serial.print("Raw data from 0x59: ");
        for (int i = 0; i < 6; i++) {
          byte data = Wire.read();
          Serial.print("0x");
          if (data < 16) Serial.print("0");
          Serial.print(data, HEX);
          Serial.print(" ");
        }
        Serial.println();
      } else {
        Serial.println("Not enough data received from 0x59");
      }
    } else {
      Serial.println("Failed to send command to 0x59");
    }
  }
  
  // Now try the Adafruit library initialization with multiple attempts
  bool sensorFound = false;
  
  // First try with SGP30 library
  for (int attempt = 1; attempt <= 2 && !sensorFound; attempt++) {
    Serial.print("SGP30 init attempt ");
    Serial.print(attempt);
    Serial.println("/2 (standard address)");
    delay(50);
    
    sensorFound = sgp30.begin();
    
    if (sensorFound) {
      Serial.println("SGP30 sensor initialized successfully at 0x58!");
      sensorType = "SGP30";
      delay(50);
    } else {
      Serial.println("SGP30 init failed at standard address");
      delay(500);
    }
  }
  
  // If SGP30 failed, try SGP40
  if (!sensorFound) {
    Serial.println("Trying SGP40 initialization...");
    
    for (int attempt = 1; attempt <= 2 && !sensorFound; attempt++) {
      Serial.print("SGP40 init attempt ");
      Serial.print(attempt);
      Serial.println("/2");
      delay(50);
      
      if (sgp40.begin()) {
        Serial.println("SGP40 sensor initialized successfully!");
        sensorFound = true;
        useSGP40 = true;
        sensorType = "SGP40";
        delay(50);
      } else {
        Serial.println("SGP40 init failed");
        delay(500);
      }
    }
  }
  
  // If not found, try manual initialization for device at 0x59
  if (!sensorFound && foundAt0x59) {
    Serial.println("Attempting manual initialization for device at 0x59");
    delay(50);
    
    // Try to initialize the sensor with a custom I2C address
    // This is a workaround since the Adafruit library doesn't support changing the address
    
    // First, send init command to 0x59
    Wire.beginTransmission(0x59);
    Wire.write(0x20); // Init air quality command
    Wire.write(0x03);
    error = Wire.endTransmission();
    
