Aricg/esp32/esp32/ESP8266_SGP30_gas_sensor/src/main.cpp
    if (error == 0) {
      Serial.println("Sent init command to device at 0x59");
      delay(10);
      
      // Wait for sensor initialization (10ms according to datasheet)
      delay(10);
      
      // Try to read from the device to confirm it's working
      Wire.beginTransmission(0x59);
      Wire.write(0x20); // Measure air quality command
      Wire.write(0x08);
      error = Wire.endTransmission();
      
      if (error == 0) {
        delay(50); // Wait for measurement
        
        // Read measurement data
        Wire.requestFrom(0x59, 6);
        if (Wire.available() >= 6) {
          uint16_t co2 = (Wire.read() << 8) | Wire.read();
          Wire.read(); // CRC
          uint16_t tvoc = (Wire.read() << 8) | Wire.read();
          Wire.read(); // CRC
          
          Serial.println("Manual reading from device at 0x59:");
          Serial.print("CO2: "); Serial.print(co2); Serial.println(" ppm");
          Serial.print("TVOC: "); Serial.print(tvoc); Serial.println(" ppb");
          
          // If we got reasonable values, consider the sensor found
          if (co2 > 0 && co2 < 60000 && tvoc < 60000) {
            sensorFound = true;
            useManualReading = true;
            sensorAddress = 0x59;
            Serial.println("Manual initialization successful!");
          } else {
            Serial.println("Received invalid values from device");
          }
        } else {
          Serial.println("Not enough data received from device");
        }
      } else {
        Serial.println("Failed to send measure command");
      }
    } else {
      Serial.println("Failed to send init command");
    }
  }
  
  if (!sensorFound) {
    // Try one more approach - direct communication with device at 0x59
    if (foundAt0x59) {
      Serial.println("Trying direct communication with device at 0x59 as last resort...");
      
      // Try different commands for different sensor types
      bool success = false;
      
      // Try SGP30 command
      Wire.beginTransmission(0x59);
      Wire.write(0x20); // Measure air quality command for SGP30
      Wire.write(0x08);
      byte error = Wire.endTransmission();
      
      if (error == 0) {
        delay(50);
        if (Wire.requestFrom((uint8_t)0x59, (uint8_t)6) == 6) {
          uint16_t co2 = (Wire.read() << 8) | Wire.read();
          Wire.read(); // CRC
          uint16_t tvoc = (Wire.read() << 8) | Wire.read();
          Wire.read(); // CRC
          
          if (co2 > 0 && co2 < 60000 && tvoc < 60000) {
            Serial.println("SGP30-compatible device detected at 0x59!");
            sensorFound = true;
            useManualReading = true;
            sensorAddress = 0x59;
            sensorType = "SGP30";
            success = true;
          }
        }
      }
      
      // If SGP30 failed, try SGP40/41
      if (!success) {
        Wire.beginTransmission(0x59);
        Wire.write(0x26); // Raw signal command for SGP40/41
        Wire.write(0x0F);
        error = Wire.endTransmission();
        
        if (error == 0) {
          delay(50);
          if (Wire.requestFrom((uint8_t)0x59, (uint8_t)3) == 3) {
            uint16_t raw = (Wire.read() << 8) | Wire.read();
            Wire.read(); // CRC
            
            if (raw > 0 && raw < 60000) {
              Serial.println("SGP40/41-compatible device detected at 0x59!");
              sensorFound = true;
              useManualReading = true;
              sensorAddress = 0x59;
              sensorType = "SGP40";
              success = true;
            }
          }
        }
      }
    }
    
    if (!sensorFound) {
      Serial.println("Failed to find any SGP sensor after multiple attempts.");
      Serial.println("The program will continue but sensor readings will be invalid.");
    }
  } else {
    // Sensor found, print serial number if available
    if (!useManualReading) {
      if (sensorType == "SGP30") {
        Serial.print("Found SGP30 serial #");
        Serial.print(sgp30.serialnumber[0], HEX);
        Serial.print(sgp30.serialnumber[1], HEX);
        Serial.println(sgp30.serialnumber[2], HEX);
      } else if (sensorType == "SGP40") {
        Serial.println("SGP40 detected (serial number not available)");
      }
    }
    
    // Print which mode we're using
    Serial.print("Using ");
    if (useManualReading) {
      Serial.print("manual reading at address 0x");
      Serial.print(sensorAddress, HEX);
    } else {
      Serial.print("Adafruit library at standard address");
    }
    
    Serial.print(" - Detected sensor type: ");
    Serial.println(sensorType);
  }

  // Set up initial baseline after 12 hours
  Serial.println("Waiting for sensor to warm up...");
}

void loop() {
  static uint8_t failCount = 0;
  static bool sensorWorking = true;
  static uint32_t printInterval = 0;
  static bool manualAttemptMade = false;
  
  // Measure every second
  if (millis() - lastMeasurement > 1000) {
    lastMeasurement = millis();
    
    // If sensor not working and we haven't tried manual mode yet, try it
    if (!sensorWorking && !manualAttemptMade && !useManualReading) {
      Serial.println("Trying manual communication with device at 0x59...");
      
      // Try to communicate with the device at 0x59
      Wire.beginTransmission(0x59);
      byte error = Wire.endTransmission();
      
      if (error == 0) {
        Serial.println("Device found at 0x59, attempting manual initialization");
        
        // Initialize the sensor
        Wire.beginTransmission(0x59);
        Wire.write(0x20); // Init air quality command
        Wire.write(0x03);
        error = Wire.endTransmission();
        
        if (error == 0) {
          Serial.println("Manual initialization successful!");
          useManualReading = true;
          sensorAddress = 0x59;
          sensorWorking = true;
          failCount = 0;
        }
      }
      
      manualAttemptMade = true;
    }
    
    if (sensorWorking) {
      bool readSuccess = false;
      
      if (useManualReading) {
        // Manual reading for device at alternate address
        if (sensorType == "SGP40" || sensorType == "SGP41") {
          // SGP40/41 use different commands
          Wire.beginTransmission(sensorAddress);
          Wire.write(0x26); // Measure Raw command
          Wire.write(0x0F);
          byte error = Wire.endTransmission();
          
