Aricg/esp32/esp32/ESP8266_SGP30_gas_sensor/src/main.cpp
          if (error == 0) {
            delay(50); // Wait for measurement
            
            // Read measurement data (raw VOC only)
            Wire.requestFrom((uint8_t)sensorAddress, (uint8_t)3);
            if (Wire.available() >= 3) {
              uint16_t rawVOC = (Wire.read() << 8) | Wire.read();
              Wire.read(); // CRC
              
              // Process the raw reading to get a more reasonable VOC index
              // SGP40 raw values are typically in the 20,000-40,000 range
              // Convert to a 0-500 scale similar to the library's VOC index
              int vocIndex;
              if (rawVOC > 40000) {
                vocIndex = 500; // Very high VOC
              } else if (rawVOC < 20000) {
                vocIndex = 0; // Very low VOC
              } else {
                // Map 20000-40000 to 0-500
                vocIndex = map(rawVOC, 20000, 40000, 0, 500);
              }
              
              TVOC = vocIndex;
              
              // Convert VOC index to approximate eCO2
              if (vocIndex < 100) {
                eCO2 = 400 + vocIndex; // Minimal CO2 increase for good air
              } else {
                eCO2 = 500 + (vocIndex - 100) * 5; // More aggressive scaling for poor air
              }
              
              readSuccess = true;
              
              // Debug info
              Serial.print("Raw SGP40: ");
              Serial.print(rawVOC);
              Serial.print(", Converted VOC Index: ");
              Serial.println(vocIndex);
            }
          }
        } else {
          // Default to SGP30 protocol
          Wire.beginTransmission(sensorAddress);
          Wire.write(0x20); // Measure air quality command
          Wire.write(0x08);
          byte error = Wire.endTransmission();
          
          if (error == 0) {
            delay(50); // Wait for measurement
            
            // Read measurement data
            Wire.requestFrom((uint8_t)sensorAddress, (uint8_t)6);
            if (Wire.available() >= 6) {
              eCO2 = (Wire.read() << 8) | Wire.read();
              Wire.read(); // CRC
              TVOC = (Wire.read() << 8) | Wire.read();
              Wire.read(); // CRC
              
              // Accept the readings as they are - this sensor might use different values
              
              readSuccess = true;
            }
          }
        }
      } else if (useSGP40) {
        // SGP40 library reading - use the VOC algorithm
        int32_t voc_index = sgp40.measureVOC();
        if (voc_index >= 0) {
          // SGP40 provides VOC index (0-500 scale)
          TVOC = voc_index; // This is already processed by the library
          
          // Convert VOC index to approximate eCO2 (very rough estimate)
          // VOC index of 100 is "normal", higher is worse air quality
          if (voc_index < 100) {
            eCO2 = 400 + voc_index; // Minimal CO2 increase for good air
          } else {
            eCO2 = 500 + (voc_index - 100) * 5; // More aggressive scaling for poor air
          }
          
          readSuccess = true;
          
          // Debug info
          Serial.print("SGP40 VOC Index: ");
          Serial.println(voc_index);
        }
      } else {
        // SGP30 library reading
        readSuccess = sgp30.IAQmeasure();
        if (readSuccess) {
          TVOC = sgp30.TVOC;
          eCO2 = sgp30.eCO2;
        }
      }
      
      if (!readSuccess) {
        failCount++;
        
        // Only print every 5 seconds to reduce serial traffic
        if (millis() - printInterval > 5000) {
          printInterval = millis();
          Serial.print("Measurement failed (");
          Serial.print(failCount);
          Serial.println("/5)");
          delay(10);
        }
        
        // After 5 consecutive failures, try to reinitialize
        if (failCount >= 5) {
          Serial.println("Reinitializing sensor...");
          delay(10);
          
          if (useManualReading) {
            // Try to reinitialize manually
            Wire.beginTransmission(sensorAddress);
            Wire.write(0x20); // Init air quality command
            Wire.write(0x03);
            byte error = Wire.endTransmission();
            sensorWorking = (error == 0);
          } else if (useSGP40) {
            sensorWorking = sgp40.begin();
          } else {
            sensorWorking = sgp30.begin();
          }
          
          if (sensorWorking) {
            Serial.println("Sensor reinitialized OK");
            delay(10);
            failCount = 0;
          }
        }
      } else {
        // Reset fail counter on successful reading
        failCount = 0;
        
        // Print readings every 5 seconds to reduce serial traffic
        if (millis() - printInterval > 5000) {
          printInterval = millis();
          Serial.print("TVOC: "); 
          Serial.print(TVOC); 
          Serial.print(" ppb, eCO2: "); 
          Serial.print(eCO2); 
          Serial.println(" ppm");
          delay(10);
        }
      }
    } else {
      // Try to reinitialize the sensor periodically
      static uint32_t lastReconnectAttempt = 0;
      if (millis() - lastReconnectAttempt > 30000) { // Try every 30 seconds
        lastReconnectAttempt = millis();
        Serial.println("Reconnecting to sensor...");
        delay(10);
        if (useSGP40) {
          sensorWorking = sgp40.begin();
        } else {
          sensorWorking = sgp30.begin();
        }
        if (sensorWorking) {
          Serial.println("Sensor reconnected");
          delay(10);
          failCount = 0;
        }
      }
    }
    
    // Optional: Set absolute humidity to improve accuracy (uncomment if you have temp/humidity sensor)
    // float temperature = 22.1; // Replace with actual temperature reading
    // float humidity = 45.2;    // Replace with actual humidity reading
    // sgp.setHumidity(getAbsoluteHumidity(temperature, humidity));
  }
  
